---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption.ByType
enum: Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption
source: html/d9416587-7a7d-3785-b6db-7e4004aeadb3.htm
---
# Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption.ByType

Railing height is determined by railing type.